In [1]:
import pandas as pd

In [2]:
path_csv = './dataset/StockData.csv'
data_csv = pd.read_csv(path_csv)

In [3]:
data_csv.head()

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556

In [4]:
# converting the date column to datetime format
data_csv['date']  = pd.to_datetime(data_csv['date'],dayfirst=True)

In [5]:
data_csv.head()

  stock       date    price
0  AAPL 2013-02-08  67.8542
1  AAPL 2013-02-11  68.5614
2  AAPL 2013-02-12  66.8428
3  AAPL 2013-02-13  66.7156
4  AAPL 2013-02-14  66.6556

In [6]:
data_csv['date'].dt.strftime('%m/%d/%Y')

0       02/08/2013
1       02/11/2013
2       02/12/2013
3       02/13/2013
4       02/14/2013
           ...
5031    02/01/2018
5032    02/02/2018
5033    02/05/2018
5034    02/06/2018
5035    02/07/2018
Name: date, Length: 5036, dtype: object

In [7]:
data_csv['date'].dt.strftime('%m-%d-%y')

0       02-08-13
1       02-11-13
2       02-12-13
3       02-13-13
4       02-14-13
          ...
5031    02-01-18
5032    02-02-18
5033    02-05-18
5034    02-06-18
5035    02-07-18
Name: date, Length: 5036, dtype: object

In [8]:
# Extracting year from the date column
data_csv['date'].dt.year

0       2013
1       2013
2       2013
3       2013
4       2013
        ...
5031    2018
5032    2018
5033    2018
5034    2018
5035    2018
Name: date, Length: 5036, dtype: int32

In [9]:
# Creating a new column and adding the extracted year values into the dataframe.
data_csv['year'] = data_csv['date'].dt.year

In [10]:
# Extracting month from the date column
data_csv['date'].dt.month

0       2
1       2
2       2
3       2
4       2
       ..
5031    2
5032    2
5033    2
5034    2
5035    2
Name: date, Length: 5036, dtype: int32

In [11]:
data_csv.head()

  stock       date    price  year
0  AAPL 2013-02-08  67.8542  2013
1  AAPL 2013-02-11  68.5614  2013
2  AAPL 2013-02-12  66.8428  2013
3  AAPL 2013-02-13  66.7156  2013
4  AAPL 2013-02-14  66.6556  2013

In [12]:
# Creating a new column and adding the extracted year values into the dataframe.
data_csv['month'] = data_csv['date'].dt.month

In [13]:
# Extracting day from the date column
data_csv['date'].dt.day

0        8
1       11
2       12
3       13
4       14
        ..
5031     1
5032     2
5033     5
5034     6
5035     7
Name: date, Length: 5036, dtype: int32

In [14]:
# Creating a new column and adding the extracted date values into the dataframe.
data_csv['day'] = data_csv['date'].dt.day

In [15]:
data_csv.head()

  stock       date    price  year  month  day
0  AAPL 2013-02-08  67.8542  2013      2    8
1  AAPL 2013-02-11  68.5614  2013      2   11
2  AAPL 2013-02-12  66.8428  2013      2   12
3  AAPL 2013-02-13  66.7156  2013      2   13
4  AAPL 2013-02-14  66.6556  2013      2   14

In [16]:
# The datetime format is convenient for many tasks!
data_csv['date'][1]-data_csv['date'][0]

Timedelta('3 days 00:00:00')